# Parameter Type Id Beam System 3d Param Property

Source: https://www.revitapidocs.com/2026/6e8ade0e-d9dd-440e-b7fa-6a6f38c50007.htm

---

| Parameter Type Id Beam System 3d Param Property |
| --- |

"Non\-planar"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId BeamSystem3dParam { get; }
```

```
Public Shared ReadOnly Property BeamSystem3dParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ BeamSystem3dParam {
	ForgeTypeId^ get ();
}
```

```
static member BeamSystem3dParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace